In [86]:
import pandas as pd

In [87]:
names = ['Bob','Jessica','Mary','John','Mel']

In [88]:
bsdegrees = [1,1,0,0,1]

In [152]:
msdegrees = [2,1,0,0,0]

In [153]:
phddegrees = [0,1,0,0,0]

In [154]:
ssns = ['867-53-0909','333-22-4444','123-12-1234','777-93-9311','123-12-1423']

In [155]:
grades = [76,95,77,78,99]

In [156]:
GradeList = zip(names,grades,bsdegrees,msdegrees,phddegrees,ssns)

In [157]:
columns=['Names','Grades','BS','MS','PhD',"ssn"]

In [158]:
df = pd.DataFrame(data = GradeList, columns=columns)

In [159]:
df

     Names  Grades  BS  MS  PhD          ssn
0      Bob      76   1   2    0  867-53-0909
1  Jessica      95   1   1    1  333-22-4444
2     Mary      77   0   0    0  123-12-1234
3     John      78   0   0    0  777-93-9311
4      Mel      99   1   0    0  123-12-1423

In [160]:
def right(s, amount): return s[-amount]

In [161]:
def standardize_ssn(ssn):
    try:
        ssn = ssn.replace("-","")
        ssn = "".join(ssn.split())
        if len(ssn)<9 and ssn != 'Missing':
            ssn="000000000" + ssn
            ssn=right(ssn,9)
    except:
        pass
    return ssn
df.ssn = df.ssn.apply(standardize_ssn)

In [162]:
df

     Names  Grades  BS  MS  PhD        ssn
0      Bob      76   1   2    0  867530909
1  Jessica      95   1   1    1  333224444
2     Mary      77   0   0    0  123121234
3     John      78   0   0    0  777939311
4      Mel      99   1   0    0  123121423

In [171]:
bins = [0, 79, 100]

In [172]:
pass_fail = ['Fail', "Pass"]

In [173]:
df['Pass/Fail'] = pd.cut(df['Grades'], bins,
        labels=pass_fail)

In [174]:
df

     Names  Grades  BS  MS  PhD        ssn Pass/Fail
0      Bob      76   1   2    0  867530909      Fail
1  Jessica      95   1   1    1  333224444      Pass
2     Mary      77   0   0    0  123121234      Fail
3     John      78   0   0    0  777939311      Fail
4      Mel      99   1   0    0  123121423      Pass